# Напишите программу, которая принимает на вход координаты точки (X и Y), 
# причём X ≠ 0 и Y ≠ 0 и выдаёт номер четверти плоскости, 
# в которой находится эта точка (или на какой оси она находится).

x = float(input('Введите координаты точки по оси X: '))
y = float(input('Введите координаты точки по оси Y: '))

if x > 0 and y > 0:
    print(f'Точка с координатами ({x},{y}) находится в I четверти')
elif x < 0 and y > 0:
    print(f'Точка с координатами ({x},{y}) находится в II четверти')
elif x < 0 and y < 0:
    print(f'Точка с координатами ({x},{y}) находится в III четверти')
elif x > 0 and y < 0:
    print(f'Точка с координатами ({x},{y}) находится в IV четверти')
else:
    print('Точка лежит на оси')

# Вариант записи
# x = float(input('Введите координаты точки по оси X: '))
# y = float(input('Введите координаты точки по оси Y: '))

# if x > 0:
#     if(y>0):
#         print(f'Точка с координатами ({x},{y}) находится в I четверти')
#     elif(y<0):
#         print(f'Точка с координатами ({x},{y}) находится в IV четверти')
# elif x < 0:
#     if y > 0:
#         print(f'Точка с координатами ({x},{y}) находится в II четверти')
#     elif y < 0:
#         print(f'Точка с координатами ({x},{y}) находится в III четверти')
# elif x == 0 or y == 0:
#     print('Точка лежит на оси')