# Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.

number = int(input('Введите число от 1 до 7: '))

if number in range (1,6):
    print('Это не выходной день.')
elif number in range (6,8):
    print('Ура! Выходной)')
else:
    print('Некорректное значение')